{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<[|endofprompt|]>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "[PAD]": 0,
      "[BOS]": 1,
      "[EOS]": 2,
      "[CLS]": 3,
      "[SEP]": 4,
      "[MASK]": 5,
      "[UNK]": 6,
      "!": 7,
      "\"": 8,
      "#": 9,
      "$": 10,
      "%": 11,
      "&": 12,
      "'": 13,
      "(": 14,
      ")": 15,
      "*": 16,
      "+": 17,
      ",": 18,
      "-": 19,
      ".": 20,
      "/": 21,
      "0": 22,
      "1": 23,
      "2": 24,
      "3": 25,
      "4": 26,
      "5": 27,
      "6": 28,
      "7": 29,
      "8": 30,
      "9": 31,
      ":": 32,
      ";": 33,
      "<": 34,
      "=": 35,
      ">": 36,
      "?": 37,
      "@": 38,
      "A": 39,
      "B": 40,
      "C": 41,
      "D": 42,
      "E": 43,
      "F": 44,
      "G": 45,
      "H": 46,
      "I": 47,
      "J": 48,
      "K": 49,
      "L": 50,
      "M": 51,
      "N": 52,
      "O": 53,
      "P": 54,
      "Q": 55,
      "R": 56,
      "S": 57,
      "T": 58,
      "U": 59,
      "V": 60,
      "W": 61,
      "X": 62,
      "Y": 63,
      "Z": 64,
      "[": 65,
      "\\": 66,
      "]": 67,
      "^": 68,
      "_": 69,
      "`": 70,
      "a": 71,
      "b": 72,
      "c": 73,
      "d": 74,
      "e": 75,
      "f": 76,
      "g": 77,
      "h": 78,
      "i": 79,
      "j": 80,
      "k": 81,
      "l": 82,
      "m": 83,
      "n": 84,
      "o": 85,
      "p": 86,
      "q": 87,
      "r": 88,
      "s": 89,
      "t": 90,
      "u": 91,
      "v": 92,
      "w": 93,
      "x": 94,
      "y": 95,
      "z": 96,
      "{": 97,
      "|": 98,
      "}": 99,
      "~": 100,
      "·": 101,
      "½": 102,
      "¿": 103,
      "Ë": 104,
      "Ì": 105,
      "Ñ": 106,
      "Õ": 107,
      "×": 108,
      "Ù": 109,
      "ï": 110,
      "Ā": 111,
      "Ċ": 112,
      "č": 113,
      "Ġ": 114,
      "ġ": 115,
      "Ģ": 116,
      "ĩ": 117,
      "Ĵ": 118,
      "Ķ": 119,
      "ķ": 120,
      "ľ": 121,
      "Ł": 122,
      "čĊ": 123,
      "Ġt": 124,
      "he": 125,
      "in": 126,
      "Ġa": 127,
      "re": 128,
      "on": 129,
      "er": 130,
      "at": 131,
      "Ġthe": 132,
      "Ġs": 133,
      "or": 134,
      "es": 135,
      "is": 136,
      "Ġc": 137,
      "en": 138,
      "it": 139,
      "an": 140,
      "ion": 141,
      "al": 142,
      "Ġo": 143,
      "le": 144,
      "ing": 145,
      "Ġp": 146,
      "Ġw": 147,
      "Ġf": 148,
      "ro": 149,
      "ed": 150,
      "ar": 151,
      "ct": 152,
      "Ġd": 153,
      "Ġb": 154,
      "Ġm": 155,
      "Ġin": 156,
      "st": 157,
      "Ġof": 158,
      "ic": 159,
      "Ġan": 160,
      "Ġto": 161,
      "ou": 162,
      "et": 163,
      "..": 164,
      "¿½": 165,
      "ï¿½": 166,
      "Ġth": 167,
      "ent": 168,
      "as": 169,
      "Ġ(": 170,
      "Ġn": 171,
      "Ġe": 172,
      "Ġis": 173,
      "the": 174,
      "ĠT": 175,
      "Ġand": 176,
      "om": 177,
      "us": 178,
      "Ġre": 179,
      "id": 180,
      "ut": 181,
      "lo": 182,
      "am": 183,
      "im": 184,
      "ly": 185,
      "Ġ1": 186,
      "Ġ.": 187,
      "ation": 188,
      "il": 189,
      "ac": 190,
      "ve": 191,
      "Ġh": 192,
      "ig": 193,
      "un": 194,
      "em": 195,
      "ĠI": 196,
      "od": 197,
      "el": 198,
      "ag": 199,
      "Ġl": 200,
      "ec": 201,
      "ot": 202,
      "Ġthat": 203,
      "ad": 204,
      "ĠA": 205,
      "Ġfor": 206,
      "Ġpro": 207,
      "if": 208,
      "ul": 209,
      "Ġv": 210,
      "ĠThe": 211,
      "and": 212,
      "....": 213,
      "Ġ2": 214,
      "ow": 215,
      "ith": 216,
      "ab": 217,
      "Ġon": 218,
      "ĠS": 219,
      "ction": 220,
      "Ġg": 221,
      "ter": 222,
      "ur": 223,
      "ce": 224,
      "ol": 225,
      "Ġst": 226,
      "ri": 227,
      "res": 228,
      "ess": 229,
      "ĠC": 230,
      "Ġus": 231,
      "um": 232,
      "ap": 233,
      "Ġbe": 234,
      "ver": 235,
      "qu": 236,
      "Ġit": 237,
      "Ġcon": 238,
      "of": 239,
      "se": 240,
      "ay": 241,
      "ate": 242,
      "ch": 243,
      "Ġex": 244,
      "Ġas": 245,
      "Ġal": 246,
      "Ġy": 247,
      "Ġwe": 248,
      "ist": 249,
      "Ġ=": 250,
      "ple": 251,
      "th": 252,
      "ĠF": 253,
      "pl": 254,
      "ain": 255,
      "Ġare": 256,
      "Ġcom": 257,
      "ĠP": 258,
      "ĠW": 259,
      "cid": 260,
      "Ġwith": 261,
      "ir": 262,
      "ers": 263,
      "for": 264,
      "ect": 265,
      "Ġï¿½": 266,
      "ore": 267,
      "ure": 268,
      "Ġcan": 269,
      "Ġyou": 270,
      "pt": 271,
      "age": 272,
      "to": 273,
      "nt": 274,
      "cess": 275,
      "per": 276,
      "Ġr": 277,
      "Ġwh": 278,
      "Ġ0": 279,
      "ĠM": 280,
      "iz": 281,
      "ex": 282,
      "est": 283,
      "yst": 284,
      "pro": 285,
      "ity": 286,
      "Ġde": 287,
      "ystem": 288,
      "Ġor": 289,
      "ew": 290,
      "Ġby": 291,
      "00": 292,
      "rom": 293,
      "ass": 294,
      "ill": 295,
      "ine": 296,
      "ĠE": 297,
      "are": 298,
      "Ġthis": 299,
      "ĠL": 300,
      "Ġk": 301,
      "Ġ3": 302,
      "ĠB": 303,
      "Ġlo": 304,
      "ĠD": 305,
      "ment": 306,
      "up": 307,
      "ive": 308,
      "ach": 309,
      "ile": 310,
      "able": 311,
      "........": 312,
      "ere": 313,
      "ĠIn": 314,
      "iv": 315,
      ").": 316,
      "ave": 317,
      "ich": 318,
      "Ġse": 319,
      "ther": 320,
      "ĠR": 321,
      "all": 322,
      "ĠN": 323,
      "igh": 324,
      "Ġch": 325,
      "Ġnot": 326,
      "Ġat": 327,
      "unction": 328,
      "ame": 329,
      "ak": 330,
      "ult": 331,
      "end": 332,
      "ally": 333,
      "ld": 334,
      "act": 335,
      "os": 336,
      "ire": 337,
      "put": 338,
      "ant": 339,
      "art": 340,
      "low": 341,
      "Ġsh": 342,
      "ork": 343,
      "Ġfrom": 344,
      "ĠH": 345,
      "alu": 346,
      "ru": 347,
      "Ġ4": 348,
      "ck": 349,
      "ind": 350,
      "ari": 351,
      "ang": 352,
      "),": 353,
      "ust": 354,
      "hen": 355,
      "ata": 356,
      "ĠTh": 357,
      "ight": 358,
      "int": 359,
      "Ġap": 360,
      "ĠO": 361,
      "ory": 362,
      "Ġle": 363,
      "form": 364,
      "Ġsu": 365,
      "ort": 366,
      "Ġim": 367,
      "Ġsp": 368,
      "gr": 369,
      "ble": 370,
      "ode": 371,
      "Ġwhich": 372,
      "ated": 373,
      "ould": 374,
      "ack": 375,
      "Ġun": 376,
      "ition": 377,
      "ial": 378,
      "ĠU": 379,
      "ress": 380,
      "Ġad": 381,
      "Ġhave": 382,
      "Ġi": 383,
      "Ġcl": 384,
      "ations": 385,
      "ies": 386,
      "Ġsystem": 387,
      "Ġcont": 388,
      "ard": 389,
      "out": 390,
      "Ġdo": 391,
      "so": 392,
      "ign": 393,
      "Ġx": 394,
      "de": 395,
      "Ġtr": 396,
      "Ġfunction": 397,
      "Ġ5": 398,
      "ample": 399,
      "ost": 400,
      "ject": 401,
      "av": 402,
      "our": 403,
      "rib": 404,
      "ener": 405,
      "etw": 406,
      "Ġwill": 407,
      "cl": 408,
      "Ġres": 409,
      "Ġmod": 410,
      "eth": 411,
      "ext": 412,
      "fere": 413,
      "con": 414,
      "ord": 415,
      "yp": 416,
      "Ġprocess": 417,
      "Ġif": 418,
      "ens": 419,
      "ome": 420,
      "here": 421,
      "ff": 422,
      "ok": 423,
      "ĠThis": 424,
      "Ġuse": 425,
      "ution": 426,
      "ĠG": 427,
      "ime": 428,
      "ber": 429,
      "()": 430,
      "ace": 431,
      "Ġne": 432,
      "du": 433,
      "Ġone": 434,
      "aus": 435,
      "ning": 436,
      "ase": 437,
      "rit": 438,
      "ical": 439,
      "Ġj": 440,
      "op": 441,
      "Ġob": 442,
      "10": 443,
      "ans": 444,
      "Ġdis": 445,
      "pon": 446,
      "ast": 447,
      "arg": 448,
      "read": 449,
      "ide": 450,
      "ll": 451,
      "ance": 452,
      "ice": 453,
      "Ġ6": 454,
      "ail": 455,
      "Ġdata": 456,
      "port": 457,
      "Ġall": 458,
      "Ġfile": 459,
      "Ġar": 460,
      "ep": 461,
      "Ġvalu": 462,
      "com": 463,
      "Ġset": 464,
      "ents": 465,
      "Ġadd": 466,
      "gram": 467,
      "Ġ|": 468,
      "Ġhas": 469,
      "ser": 470,
      "nd": 471,
      "ern": 472,
      "Ġac": 473,
      "gh": 474,
      "ĠWe": 475,
      "ating": 476,
      "Ġ{": 477,
      "plic": 478,
      "Ġ7": 479,
      "ous": 480,
      "ary": 481,
      "Ġ,": 482,
      "Ġclass": 483,
      "ors": 484,
      "ik": 485,
      "Ġbut": 486,
      "tr": 487,
      ".,": 488,
      "Ġnum": 489,
      "ates": 490,
      "own": 491,
      "Ġ<": 492,
      "Ġvari": 493,
      "12": 494,
      "ions": 495,
      "................": 496,
      "Ġout": 497,
      "Ġsc": 498,
      "erm": 499,
      "Ġpre": 500,
      "Ġcomm": 501,
      "Ġ8": 502,
      "wo": 503,
      "ĠIf": 504,
      "her": 505,
      "ofthe": 506,
      "lock": 507,
      "ĠčĊ": 508,
      "apter": 509,
      "Ġso": 510,
      "irst": 511,
      "Ġdef": 512,
      "ollow": 513,
      "igure": 514,
      "Ġits": 515,
      "Ġother": 516,
      "Ġdes": 517,
      "led": 518,
      "Ġab": 519,
      "ip": 520,
      "urn": 521,
      "oint": 522,
      "les": 523,
      "ake": 524,
      "by": 525,
      "Ġele": 526,
      "Ġ[": 527,
      "irect": 528,
      "te": 529,
      "Ġinter": 530,
      "Ġmore": 531,
      "Ġman": 532,
      "iffere": 533,
      "der": 534,
      "Ġexample": 535,
      "ages": 536,
      "emory": 537,
      "ruct": 538,
      "Ġeach": 539,
      "Ġmodel": 540,
      "ize": 541,
      "Ġwhen": 542,
      "ĠV": 543,
      "ethod": 544,
      "Ġ10": 545,
      "ces": 546,
      "ĠFor": 547,
      "Ġ}": 548,
      "ular": 549,
      "ell": 550,
      "Ġup": 551,
      "ree": 552,
      "ong": 553,
      "Ġtime": 554,
      "ual": 555,
      "Ġqu": 556,
      "ient": 557,
      "si": 558,
      "one": 559,
      "eld": 560,
      "Ġ+": 561,
      "ility": 562,
      "))": 563,
      "etwork": 564,
      "ys": 565,
      "Ġen": 566,
      "Ġsim": 567,
      "Ġ/": 568,
      "be": 569,
      "ause": 570,
      "Ġper": 571,
      "Ġtwo": 572,
      "20": 573,
      "ear": 574,
      "iles": 575,
      "Ġro": 576,
      "ield": 577,
      "Ġpage": 578,
      "ud": 579,
      "ernel": 580,
      "ose": 581,
      "Ġpart": 582,
      "ĠIt": 583,
      "Ġoper": 584,
      "aram": 585,
      "Ġthere": 586,
      "--": 587,
      "ax": 588,
      "ss": 589,
      "ence": 590,
      "ĠY": 591,
      "Ġobject": 592,
      "Ġonly": 593,
      "15": 594,
      "Ġsome": 595,
      "Ġalso": 596,
      "Ġthen": 597,
      "Ġtyp": 598,
      "Ġnew": 599,
      "Ġpr": 600,
      "that": 601,
      "Ġany": 602,
      "Ġfollow": 603,
      "Ġinst": 604,
      "19": 605,
      "Ġrequ": 606,
      "Ġvalue": 607,
      "with": 608,
      "ific": 609,
      "ĠCh": 610,
      "Ġexp": 611,
      "Ġprogram": 612,
      "Ġusing": 613,
      "Ġform": 614,
      "ced": 615,
      "Ġused": 616,
      "ĠJ": 617,
      "ifferent": 618,
      "Ġser": 619,
      "wh": 620,
      "Ġ)": 621,
      "ub": 622,
      "ization": 623,
      "ount": 624,
      "tain": 625,
      "ix": 626,
      "inu": 627,
      "ures": 628,
      "Ġev": 629,
      "its": 630,
      "Ġwork": 631,
      "Ġhe": 632,
      "aramet": 633,
      "istrib": 634,
      "fore": 635,
      "ne": 636,
      "ays": 637,
      "Ġspec": 638,
      "iew": 639,
      "urre": 640,
      "Ġ9": 641,
      "ecause": 642,
      "Ġuser": 643,
      "Ġpl": 644,
      "Ġnumber": 645,
      "ative": 646,
      "Ġhow": 647,
      "Ġsame": 648,
      "turn": 649,
      "Ġcre": 650,
      "Ġrun": 651,
      "Ġwhere": 652,
      "13": 653,
      "Ġmethod": 654,
      "ĠPro": 655,
      "Ġcode": 656,
      "cal": 657,
      "Ġmat": 658,
      ");": 659,
      "Ġneed": 660,
      "Ġgener": 661,
      "ike": 662,
      "Ġz": 663,
      "other": 664,
      "ript": 665,
      "blem": 666,
      ")(": 667,
      "Ġint": 668,
      "Ġyour": 669,
      "app": 670,
      "11": 671,
      "Ġme": 672,
      "we": 673,
      "ob": 674,
      "Ġline": 675,
      "ithm": 676,
      "Ġsuch": 677,
      "not": 678,
      "Ġ-": 679,
      "hed": 680,
      "ise": 681,
      "sh": 682,
      "uch": 683,
      "ĠEx": 684,
      "err": 685,
      "Ġthan": 686,
      "und": 687,
      "pos": 688,
      "tern": 689,
      "Ġthey": 690,
      "Ġfirst": 691,
      "ov": 692,
      "Ġcall": 693,
      "ows": 694,
      "ink": 695,
      "ĠFigure": 696,
      "ever": 697,
      "ond": 698,
      "Ġgr": 699,
      "vice": 700,
      "Ġinto": 701,
      "Ġreg": 702,
      "pend": 703,
      "Ġlist": 704,
      "Ġpos": 705,
      "Ġthese": 706,
      "hat": 707,
      "Ġwrit": 708,
      "ech": 709,
      "gor": 710,
      "resent": 711,
      "ments": 712,
      "Ġ'": 713,
      "ings": 714,
      "Ġno": 715,
      "ound": 716,
      "urrent": 717,
      "eat": 718,
      "Ġgo": 719,
      "Ġlear": 720,
      "Ġcal": 721,
      "ĠK": 722,
      "ange": 723,
      "ra": 724,
      "cept": 725,
      "ied": 726,
      "Ġget": 727,
      "Ġreturn": 728,
      "Ġsee": 729,
      "istribution": 730,
      "Ġover": 731,
      "Ġdirect": 732,
      "ci": 733,
      "gy": 734,
      "18": 735,
      "ite": 736,
      "Ġequ": 737,
      "ib": 738,
      "Ġ\"": 739,
      "ĠCon": 740,
      "Ġdifferent": 741,
      "ator": 742,
      "ethe": 743,
      "ron": 744,
      "Ġread": 745,
      "Ġsub": 746,
      "cre": 747,
      "etwe": 748,
      "aining": 749,
      "Ġ#": 750,
      "sp": 751,
      "Ġpoint": 752,
      "Ġ$": 753,
      "formation": 754,
      "ook": 755,
      "gorithm": 756,
      "ables": 757,
      "Ġcommand": 758,
      "ics": 759,
      "nce": 760,
      "ware": 761,
      "og": 762,
      "ĠX": 763,
      "Ġmemory": 764,
      "lect": 765,
      "Ġlog": 766,
      "Ġfield": 767,
      "Ġnetwork": 768,
      "orm": 769,
      "Ġfiles": 770,
      "ugh": 771,
      "Ġke": 772,
      "ER": 773,
      "ify": 774,
      "iven": 775,
      "Ġdesc": 776,
      "Ġapp": 777,
      "Ġwas": 778,
      "Ġ20": 779,
      "ry": 780,
      "oth": 781,
      "ines": 782,
      "vect": 783,
      "ĠChapter": 784,
      "16": 785,
      "ten": 786,
      "Ġ12": 787,
      "14": 788,
      "ful": 789,
      "17": 790,
      "plement": 791,
      "Ġkernel": 792,
      "Ġwould": 793,
      "Ġsec": 794,
      "Ġopt": 795,
      "cus": 796,
      "aph": 797,
      "thes": 798,
      "Ġrep": 799,
      "ĠAn": 800,
      "etween": 801,
      "ask": 802,
      "ough": 803,
      "The": 804,
      "Ġthem": 805,
      "Ġent": 806,
      "Ġdoes": 807,
      "valu": 808,
      "vers": 809,
      "Ġcol": 810,
      "sid": 811,
      "row": 812,
      "yn": 813,
      "Ġcomp": 814,
      "Ġresult": 815,
      "Ġshould": 816,
      "inal": 817,
      "loc": 818,
      "odel": 819,
      "Ġcor": 820,
      "Ġincl": 821,
      "ically": 822,
      "ery": 823,
      "Ġdec": 824,
      "ding": 825,
      "Ġmay": 826,
      "ability": 827,
      "ctions": 828,
      "ove": 829,
      "Ġdet": 830,
      "Ġappro": 831,
      "olution": 832,
      "Ġbecause": 833,
      "this": 834,
      "Ġapplic": 835,
      "rough": 836,
      "ulti": 837,
      "inter": 838,
      "ick": 839,
      "Ġstr": 840,
      "Ġconst": 841,
      "Ġkn": 842,
      "ampl": 843,
      "Ġ19": 844,
      "ĠAs": 845,
      "Ġcomput": 846,
      "Ġabout": 847,
      "Ġ*": 848,
      "ting": 849,
      "Ġthread": 850,
      "Ġlike": 851,
      "Ġstat": 852,
      "Ġbu": 853,
      "ement": 854,
      "oft": 855,
      "Ġour": 856,
      "ĠYou": 857,
      "pre": 858,
      "enc": 859,
      "Ġfollowing": 860,
      "Ġway": 861,
      "Ġprov": 862,
      "process": 863,
      "elf": 864,
      "which": 865,
      "ude": 866,
      "ier": 867,
      "Ġtest": 868,
      "di": 869,
      "can": 870,
      "dition": 871,
      "Ġname": 872,
      "Ġaddress": 873,
      "32": 874,
      "Ġtrans": 875,
      "Ġmust": 876,
      "ument": 877,
      "ized": 878,
      "very": 879,
      "Ġrel": 880,
      "Ġem": 881,
      "ĠSe": 882,
      "Ġparamet": 883,
      "Ġmake": 884,
      "Ġbetween": 885,
      "Ġpat": 886,
      "from": 887,
      "Ġind": 888,
      "ĠSt": 889,
      "ĠWhen": 890,
      "Ġstruct": 891,
      "Ġaccess": 892,
      "ased": 893,
      "arge": 894,
      "Ġact": 895,
      "ue": 896,
      "Ġerr": 897,
      "Ġterm": 898,
      "Ġpri": 899,
      "Ġproblem": 900,
      "ices": 901,
      "sible": 902,
      "Ġjust": 903,
      "ined": 904,
      "set": 905,
      "Ġcase": 906,
      "inthe": 907,
      "ĠTo": 908,
      "function": 909,
      "Ġback": 910,
      "Ġcalled": 911,
      "ute": 912,
      "PU": 913,
      "pert": 914,
      "ef": 915,
      "get": 916,
      "ually": 917,
      "vel": 918,
      "rol": 919,
      "log": 920,
      "duct": 921,
      "Ġass": 922,
      "Ġwhat": 923,
      "inux": 924,
      "IN": 925,
      "ead": 926,
      "Ġrem": 927,
      "irt": 928,
      "ural": 929,
      "Ġstart": 930,
      "ge": 931,
      "Ġexec": 932,
      "vi": 933,
      "lear": 934,
      "Ġsup": 935,
      "Ġph": 936,
      "Ġimport": 937,
      "Ġcomple": 938,
      "heck": 939,
      "ression": 940,
      "Ġstate": 941,
      "cuss": 942,
      "iss": 943,
      "achine": 944,
      "ource": 945,
      "Ġmany": 946,
      "ingle": 947,
      "ule": 948,
      "ponent": 949,
      "ache": 950,
      "ON": 951,
      "Ġtype": 952,
      "Ġblock": 953,
      "Ġvalues": 954,
      "mall": 955,
      "Ġsign": 956,
      "ved": 957,
      "Ġmost": 958,
      "ĠHow": 959,
      "sc": 960,
      "Ġperform": 961,
      "Ġtheir": 962,
      "round": 963,
      "Ġhand": 964,
      "ĠCom": 965,
      "ional": 966,
      "ark": 967,
      "In": 968,
      "Ġatt": 969,
      "akes": 970,
      "aract": 971,
      "Ġrec": 972,
      "Ġalgorithm": 973,
      "pect": 974,
      "Ġinformation": 975,
      "Ġdistribution": 976,
      "arch": 977,
      "sider": 978,
      "str": 979,
      "fer": 980,
      "respon": 981,
      "Ġpartic": 982,
      "line": 983,
      "als": 984,
      "Ġfind": 985,
      "ts": 986,
      "Ġlearning": 987,
      "par": 988,
      "Ġfeat": 989,
      "Ġinv": 990,
      "aw": 991,
      "Ġam": 992,
      "ault": 993,
      "Ġcurrent": 994,
      "ffect": 995,
      "Ġfact": 996,
      "000": 997,
      "Ġarg": 998,
      "Ġinput": 999,
      "fter": 1000,
      "rix": 1001,
      "Ġbeen": 1002,
      "Ġpass": 1003,
      "energy": 1004,
      "ym": 1005,
      "angu": 1006,
      "ities": 1007,
      "Ġthrough": 1008,
      "mat": 1009,
      "ames": 1010,
      "indows": 1011,
      "Ġallow": 1012,
      "Ġsystems": 1013,
      "word": 1014,
      "Ġcontain": 1015,
      "ĠThere": 1016,
      "ward": 1017,
      "Ġlook": 1018,
      "Ġ:": 1019,
      "Ġtext": 1020,
      "Ġvariable": 1021,
      "amples": 1022,
      "eng": 1023,
      "tt": 1024,
      "Ġend": 1025,
      "requ": 1026,
      "...": 1027,
      "cc": 1028,
      "face": 1029,
      "any": 1030,
      "vector": 1031,
      "ild": 1032,
      "Ġoutput": 1033,
      "Ġimplement": 1034,
      "Ġgiven": 1035,
      "andard": 1036,
      "isting": 1037,
      "irtual": 1038,
      "Ġop": 1039,
      "Ġ14": 1040,
      "Ġspace": 1041,
      "Ġconf": 1042,
      "ared": 1043,
      "Ġwant": 1044,
      "AP": 1045,
      "imes": 1046,
      "Ġelect": 1047,
      "Ġunder": 1048,
      "oid": 1049,
      "ases": 1050,
      "ĠAl": 1051,
      "Ġav": 1052,
      "ont": 1053,
      "system": 1054,
      "roup": 1055,
      "Ġprob": 1056,
      "................................": 1057,
      "ph": 1058,
      "ince": 1059,
      "Ġid": 1060,
      "Ġlay": 1061,
      "net": 1062,
      "Ġright": 1063,
      ")=": 1064,
      "ives": 1065,
      "Ġ13": 1066,
      "erc": 1067,
      "Ġrequest": 1068,
      "cont": 1069,
      "ater": 1070,
      "Ġ15": 1071,
      "Ġ16": 1072,
      "Ġerror": 1073,
      "over": 1074,
      "ole": 1075,
      "file": 1076,
      "andom": 1077,
      "ffic": 1078,
      "Ġmulti": 1079,
      "velo": 1080,
      "pr": 1081,
      "Ġmin": 1082,
      "ish": 1083,
      "alid": 1084,
      "Ġacc": 1085,
      "then": 1086,
      "ote": 1087,
      "Ġenergy": 1088,
      "ified": 1089,
      "itial": 1090,
      "eed": 1091,
      "ug": 1092,
      "def": 1093,
      "red": 1094,
      "Ġvery": 1095,
      "SS": 1096,
      "Ġrepresent": 1097,
      "Ġcharact": 1098,
      "Ġag": 1099,
      "21": 1100,
      "Ġapplication": 1101,
      "add": 1102,
      "ilar": 1103,
      "old": 1104,
      "ï¿½ï¿½": 1105,
      "Ġ200": 1106,
      "ev": 1107,
      "ered": 1108,
      "25": 1109,
      "Ġ11": 1110,
      "class": 1111,
      "=\"": 1112,
      "ted": 1113,
      "ray": 1114,
      "imens": 1115,
      "Ġfunctions": 1116,
      "min": 1117,
      "eli": 1118,
      "ero": 1119,
      "ood": 1120,
      "Ġdispl": 1121,
      "Ġwrite": 1122,
      "Ġmight": 1123,
      "Ġlong": 1124,
      "ash": 1125,
      "Ġanother": 1126,
      "see": 1127,
      "Ġshown": 1128,
      "Ġsingle": 1129,
      "Ġnow": 1130,
      "Ġsecond": 1131,
      "Ġdesign": 1132,
      "Ġrequire": 1133,
      "ference": 1134,
      "ton": 1135,
      "Ġdirectory": 1136,
      "me": 1137,
      "Ġkey": 1138,
      "AT": 1139,
      "Ġsize": 1140,
      "Ġbo": 1141,
      "Ġpropert": 1142,
      "ubl": 1143,
      "Ġmess": 1144,
      "hav": 1145,
      "rue": 1146,
      "22": 1147,
      "iqu": 1148,
      "vari": 1149,
      "48": 1150,
      "data": 1151,
      "model": 1152,
      "wn": 1153,
      "Ġlet": 1154,
      "',": 1155,
      "ential": 1156,
      "ails": 1157,
      "Ġboth": 1158,
      "esc": 1159,
      "Ġview": 1160,
      "ric": 1161,
      "Ġsection": 1162,
      "ĠLinux": 1163,
      "echn": 1164,
      "Ġsmall": 1165,
      "ingthe": 1166,
      "Ġelement": 1167,
      "ST": 1168,
      "ft": 1169,
      "Ġhard": 1170,
      "Ġchang": 1171,
      "Ġword": 1172,
      "Ġchange": 1173,
      "Ġfl": 1174,
      "page": 1175,
      "Ġaut": 1176,
      "io": 1177,
      "idd": 1178,
      "Ġimage": 1179,
      "Ġprint": 1180,
      "Ġnext": 1181,
      "Ġknow": 1182,
      "Ġdri": 1183,
      "ĠWindows": 1184,
      "velop": 1185,
      "atch": 1186,
      "Ġdescrib": 1187,
      "Ġdevice": 1188,
      "Ġprovid": 1189,
      "Ġcould": 1190,
      "pose": 1191,
      "Ġpo": 1192,
      "Ġevery": 1193,
      "rop": 1194,
      "Ġvers": 1195,
      "Ġmain": 1196,
      "umber": 1197,
      "Ġstructure": 1198,
      "Ġtem": 1199,
      "Ġpossible": 1200,
      "Ġlink": 1201,
      "Ġcreate": 1202,
      "Ġvariables": 1203,
      "Ġwell": 1204,
      "ational": 1205,
      "col": 1206,
      "Ġserver": 1207,
      "imit": 1208,
      "ailable": 1209,
      "hes": 1210,
      "Ġprocesses": 1211,
      "reg": 1212,
      "ade": 1213,
      "Ġgeneral": 1214,
      "24": 1215,
      "Ġeven": 1216,
      "ĠHowever": 1217,
      "ĠAd": 1218,
      "23": 1219,
      "Ġmax": 1220,
      "opy": 1221,
      "Ġdi": 1222,
      "ull": 1223,
      "vious": 1224,
      "tothe": 1225,
      "Ġeas": 1226,
      "roll": 1227,
      "writ": 1228,
      "Ġ18": 1229,
      "ĠĠ": 1230,
      "Ġcheck": 1231,
      "ection": 1232,
      "Ġed": 1233,
      "Ġdisk": 1234,
      "ior": 1235,
      "abel": 1236,
      "ian": 1237,
      "anguage": 1238,
      "Ġ17": 1239,
      "Ġdepend": 1240,
      "Ġcontrol": 1241,
      "aking": 1242,
      "Ġco": 1243,
      "ply": 1244,
      "Ġsupport": 1245,
      "ĠII": 1246,
      "Ġsimple": 1247,
      "Ġstandard": 1248,
      "aces": 1249,
      "only": 1250,
      "vices": 1251,
      "Ġdiscuss": 1252,
      "Ġtraining": 1253,
      "pri": 1254,
      "ately": 1255,
      "Ġext": 1256,
      "Ġvector": 1257,
      "ength": 1258,
      "ĠUn": 1259,
      "sw": 1260,
      "ĠAp": 1261,
      "Ġwere": 1262,
      "soci": 1263,
      "OR": 1264,
      "ĠFig": 1265,
      "man": 1266,
      "time": 1267,
      "bo": 1268,
      "oftware": 1269,
      "ism": 1270,
      "ets": 1271,
      "Ġinclud": 1272,
      "----": 1273,
      "side": 1274,
      "bers": 1275,
      "isk": 1276,
      "imum": 1277,
      "ume": 1278,
      "estim": 1279,
      "how": 1280,
      "istic": 1281,
      "ĠRe": 1282,
      "Ġchapter": 1283,
      "ĠLet": 1284,
      "ĠNow": 1285,
      "ait": 1286,
      "Ġlarge": 1287,
      "ID": 1288,
      "Ġorder": 1289,
      "Th": 1290,
      "Ġupd": 1291,
      "Ġparameters": 1292,
      "cul": 1293,
      "do": 1294,
      "user": 1295,
      "rodu": 1296,
      "Ġcorrespon": 1297,
      "hell": 1298,
      "Ġnon": 1299,
      "Ġthree": 1300,
      "ision": 1301,
      "ĠZ": 1302,
      "ves": 1303,
      "Ġmodels": 1304,
      "name": 1305,
      "</": 1306,
      "ethat": 1307,
      "):": 1308,
      "ia": 1309,
      "ways": 1310,
      "Ġlow": 1311,
      "bin": 1312,
      "80": 1313,
      "oper": 1314,
      "Ġbefore": 1315,
      "Ġinclude": 1316,
      "ĠUs": 1317,
      "RO": 1318,
      "66": 1319,
      "ification": 1320,
      "ially": 1321,
      "Ġ//": 1322,
      "ream": 1323,
      "Ġtop": 1324,
      "ency": 1325,
      "ava": 1326,
      "ertain": 1327,
      "Ġ25": 1328,
      "ither": 1329,
      "30": 1330,
      "af": 1331,
      "Ġmanag": 1332,
      "Ġdat": 1333,
      "Ġobser": 1334,
      "RE": 1335,
      "==": 1336,
      "Ġmatrix": 1337,
      "Ġstep": 1338,
      "Ġmuch": 1339,
      "ĠCPU": 1340,
      "ormal": 1341,
      "Ġlocal": 1342,
      "hedul": 1343,
      "Ġown": 1344,
      "Ġfr": 1345,
      "ason": 1346,
      "Ġinte": 1347,
      "air": 1348,
      "xim": 1349,
      "ible": 1350,
      "su": 1351,
      "rect": 1352,
      "ather": 1353,
      "Ġlinear": 1354,
      "back": 1355,
      "Ġdoc": 1356,
      "Ġtable": 1357,
      "Ġelements": 1358,
      "88": 1359,
      "used": 1360,
      "Ġprior": 1361,
      "ype": 1362,
      "hether": 1363,
      "Ġpubl": 1364,
      "Ġopen": 1365,
      "ming": 1366,
      "26": 1367,
      "Pro": 1368,
      "Ġwhile": 1369,
      "Ġgroup": 1370,
      "bit": 1371,
      ".)": 1372,
      "agnet": 1373,
      "Ġeffect": 1374,
      "...,": 1375,
      "Ġsom": 1376,
      "ML": 1377,
      "Ġpages": 1378,
      "ml": 1379,
      "ttp": 1380,
      "St": 1381,
      "echan": 1382,
      "Ġparticular": 1383,
      "ccess": 1384,
      "aussi": 1385,
      "IX": 1386,
      "dict": 1387,
      "there": 1388,
      "load": 1389,
      "Ġmethods": 1390,
      "Ġcons": 1391,
      "rupt": 1392,
      "Ġ&": 1393,
      "ected": 1394,
      "Ġet": 1395,
      "Ġgre": 1396,
      "Ġusers": 1397,
      "utes": 1398,
      "adient": 1399,
      "itive": 1400,
      "have": 1401,
      "Ġuses": 1402,
      "ĠBut": 1403,
      "Ġoperating": 1404,
      "38": 1405,
      "Ġu": 1406,
      "Ġmachine": 1407,
      "fficient": 1408,
      "Ġstring": 1409,
      "Ġvirtual": 1410,
      "Ġgraph": 1411,
      "Ġtask": 1412,
      "lp": 1413,
      "Ch": 1414,
      "Ġlearn": 1415,
      "Ġdefault": 1416,
      "27": 1417,
      "Ġweb": 1418,
      "Ġmean": 1419,
      "Ġinitial": 1420,
      "Ġafter": 1421,
      "inst": 1422,
      "28": 1423,
      "though": 1424,
      "Ġhigh": 1425,
      "Ġtake": 1426,
      "quence": 1427,
      "ĠOn": 1428,
      "yth": 1429,
      "40": 1430,
      "cor": 1431,
      "oment": 1432,
      "iron": 1433,
      "ibr": 1434,
      "Ġselect": 1435,
      "Ġshow": 1436,
      "Ġincre": 1437,
      "you": 1438,
      "ower": 1439,
      "ie": 1440,
      "Ġident": 1441,
      "Ġwithout": 1442,
      "sto": 1443,
      "Ġ>": 1444,
      "Ġel": 1445,
      "Ġcondition": 1446,
      "value": 1447,
      "sthe": 1448,
      "paramet": 1449,
      "but": 1450,
      "Ġreal": 1451,
      "29": 1452,
      "urity": 1453,
      "Ġdevelop": 1454,
      "Ġavailable": 1455,
      "Ġdown": 1456,
      "vent": 1457,
      "Ġobjects": 1458,
      "//": 1459,
      "earning": 1460,
      "__": 1461,
      "OS": 1462,
      "stand": 1463,
      "ĠSo": 1464,
      "gener": 1465,
      "Ġ%": 1466,
      "ily": 1467,
      "Ġstore": 1468,
      "ross": 1469,
      "ven": 1470,
      "ĠOne": 1471,
      "Ġoften": 1472,
      "ecom": 1473,
      "Ġpath": 1474,
      "Ġpar": 1475,
      "IT": 1476,
      "Ġpack": 1477,
      "Ġcho": 1478,
      "will": 1479,
      "Ġarray": 1480,
      "Ġdescript": 1481,
      "64": 1482,
      "Ex": 1483,
      "33": 1484,
      "ffer": 1485,
      "Ġpattern": 1486,
      "ĠQ": 1487,
      "pec": 1488,
      "igur": 1489,
      "AC": 1490,
      "Ġphys": 1491,
      "umn": 1492,
      "memory": 1493,
      "vis": 1494,
      "idden": 1495,
      "plo": 1496,
      "Ġconsider": 1497,
      "AR": 1498,
      "Ġbeing": 1499,
      "Ġapproach": 1500,
      "ĠAnd": 1501,
      "Ġcharacter": 1502,
      "Ġbook": 1503,
      "ww": 1504,
      "Ġrunning": 1505,
      "50": 1506,
      "Ġq": 1507,
      "Ġsepar": 1508,
      "order": 1509,
      "ponents": 1510,
      "ĠAll": 1511,
      "ists": 1512,
      "Ġsw": 1513,
      "Ġinstance": 1514,
      "comm": 1515,
      "Ġide": 1516,
      "use": 1517,
      "itor": 1518,
      "ath": 1519,
      "Ġpublic": 1520,
      "aps": 1521,
      "viron": 1522,
      "ances": 1523,
      "Ġsolution": 1524,
      "ĠThese": 1525,
      "Ġclo": 1526,
      "200": 1527,
      "ĠWhat": 1528,
      "LE": 1529,
      "SE": 1530,
      "gin": 1531,
      "ĠTable": 1532,
      "ython": 1533,
      "Ġload": 1534,
      "more": 1535,
      "part": 1536,
      "ger": 1537,
      "Ġzero": 1538,
      "Ġmultiple": 1539,
      "uments": 1540,
      "Ġfeatures": 1541,
      "Ġrespon": 1542,
      "hood": 1543,
      "Ġbas": 1544,
      "dat": 1545,
      "block": 1546,
      "Ġoptim": 1547,
      "pag": 1548,
      "TER": 1549,
      "ilities": 1550,
      "olic": 1551,
      "Com": 1552,
      "itect": 1553,
      "irection": 1554,
      "ently": 1555,
      "uted": 1556,
      "odes": 1557,
      "Ġtrue": 1558,
      "Ġdist": 1559,
      "Ġtechn": 1560,
      "Ġmeans": 1561,
      "depend": 1562,
      "Ġagain": 1563,
      "Ġenc": 1564,
      "ules": 1565,
      "aussian": 1566,
      "Ġaddition": 1567,
      "Ġprobability": 1568,
      "Ġoff": 1569,
      "Ġdisplay": 1570,
      "let": 1571,
      "imensional": 1572,
      "63": 1573,
      "cedure": 1574,
      "],": 1575,
      "Ġmov": 1576,
      "ators": 1577,
      "Ġdefined": 1578,
      "fo": 1579,
      "arent": 1580,
      "62": 1581,
      "iff": 1582,
      "Ġlevel": 1583,
      "rel": 1584,
      "atter": 1585,
      "Ġanal": 1586,
      "adi": 1587,
      "Ġinterface": 1588,
      "ature": 1589,
      "://": 1590,
      "Ġfil": 1591,
      "Re": 1592,
      "erest": 1593,
      "ready": 1594,
      "Ġgu": 1595,
      "Ġpriv": 1596,
      "arget": 1597,
      "urs": 1598,
      "('": 1599,
      "ĠThen": 1600,
      "Ġprodu": 1601,
      "Ġsource": 1602,
      "ĠHT": 1603,
      "Ġshows": 1604,
      "Ġimportant": 1605,
      "Ġsum": 1606,
      "Ġalways": 1607,
      "thread": 1608,
      "ourse": 1609,
      "oun": 1610,
      "Ġmessage": 1611,
      "Ġparameter": 1612,
      "ï¿½,": 1613,
      "AL": 1614,
      "Ġstill": 1615,
      "Ġbrow": 1616,
      "Ġsimilar": 1617,
      "Ġsoftware": 1618,
      "Ġproduct": 1619,
      "Ġput": 1620,
      "Ġrest": 1621,
      "35": 1622,
      "ling": 1623,
      "].": 1624,
      "ikeli": 1625,
      "ynch": 1626,
      "ality": 1627,
      "less": 1628,
      "Ġpoints": 1629,
      "\",": 1630,
      "roller": 1631,
      "Ġdocument": 1632,
      "Ġloc": 1633,
      "34": 1634,
      "Ġ!": 1635,
      "oc": 1636,
      "veral": 1637,
      "Ġrandom": 1638,
      "where": 1639,
      "0000": 1640,
      "Ġcomponent": 1641,
      "level": 1642,
      "Ġwor": 1643,
      "ikelihood": 1644,
      "first": 1645,
      "struct": 1646,
      "Ġorig": 1647,
      "Ġconstant": 1648,
      "96": 1649,
      "such": 1650,
      "Ġtry": 1651,
      "asure": 1652,
      "Ġhere": 1653,
      "Ġexamples": 1654,
      "Ġwhether": 1655,
      "ner": 1656,
      "Ġtypes": 1657,
      "ground": 1658,
      "Ġvalid": 1659,
      "Ġgood": 1660,
      "Ġfeature": 1661,
      "Ġspecific": 1662,
      "way": 1663,
      "ecan": 1664,
      "Ġdeterm": 1665,
      "Ġshell": 1666,
      "ively": 1667,
      "point": 1668,
      "ustr": 1669,
      "ynchron": 1670,
      "FS": 1671,
      "Ġocc": 1672,
      "uring": 1673,
      "Ġatom": 1674,
      "idth": 1675,
      "ources": 1676,
      "Ġwithin": 1677,
      "Ġcommon": 1678,
      "Ġ@": 1679,
      "ĠListing": 1680,
      "Ġestim": 1681,
      "Ġdefin": 1682,
      "ĠSection": 1683,
      "ION": 1684,
      "follow": 1685,
      "Ġarch": 1686,
      "Ġattrib": 1687,
      "ĠJava": 1688,
      "Ġff": 1689,
      "107": 1690,
      "Ġ30": 1691,
      "Ġneural": 1692,
      "ĠAP": 1693,
      "right": 1694,
      "max": 1695,
      "Ġcontinu": 1696,
      "HAP": 1697,
      "Ġweight": 1698,
      "99": 1699,
      "Sc": 1700,
      "rans": 1701,
      "Ġtion": 1702,
      "ystems": 1703,
      "itle": 1704,
      "comput": 1705,
      "tml": 1706,
      "ters": 1707,
      "ĠWh": 1708,
      "67": 1709,
      "direct": 1710,
      "view": 1711,
      "Ġassoci": 1712,
      "ane": 1713,
      "Ġproperty": 1714,
      "inary": 1715,
      "Ġversion": 1716,
      "ke": 1717,
      "econd": 1718,
      "Ġreason": 1719,
      "vant": 1720,
      "Ġlast": 1721,
      "Ġcap": 1722,
      "dis": 1723,
      "ears": 1724,
      "ols": 1725,
      "program": 1726,
      "when": 1727,
      "Ġmoment": 1728,
      "lass": 1729,
      "opt": 1730,
      "Ġelectron": 1731,
      "inally": 1732,
      "Ġmechan": 1733,
      "ĠAr": 1734,
      "empt": 1735,
      "Ġsym": 1736,
      "Ġmode": 1737,
      "Ġlanguage": 1738,
      "Ġcontext": 1739,
      "ember": 1740,
      "urther": 1741,
      "Ġlayer": 1742,
      "vectors": 1743,
      "Ġ...": 1744,
      "ries": 1745,
      "Ġquant": 1746,
      "Ġpost": 1747,
      "edi": 1748,
      "etter": 1749,
      "plit": 1750,
      "Ġposition": 1751,
      "ma": 1752,
      "lection": 1753,
      "incl": 1754,
      "ercise": 1755,
      "Ġsince": 1756,
      "Ġnetworks": 1757,
      "ee": 1758,
      "Ġoperation": 1759,
      "head": 1760,
      "Ġhelp": 1761,
      "Ġcontains": 1762,
      "sthat": 1763,
      "based": 1764,
      "ĠInt": 1765,
      "cho": 1766,
      "Ġclasses": 1767,
      "Ġing": 1768,
      "indow": 1769,
      "Ġspecial": 1770,
      "Ġchanges": 1771,
      "Ġear": 1772,
      "EN": 1773,
      "ĠIm": 1774,
      "plication": 1775,
      "exp": 1776,
      "Ġfew": 1777,
      "Ġloop": 1778,
      "'s": 1779,
      "Ġproject": 1780,
      "Ġcomplex": 1781,
      "ense": 1782,
      "Ġï¿½ï¿½": 1783,
      "Ġassign": 1784,
      "ynam": 1785,
      "most": 1786,
      "kernel": 1787,
      "appro": 1788,
      "list": 1789,
      "izing": 1790,
      "Ġknown": 1791,
      "ĠSee": 1792,
      "Ġthreads": 1793,
      "result": 1794,
      "Ġself": 1795,
      "Ġnames": 1796,
      "aving": 1797,
      "Figure": 1798,
      "Ġfree": 1799,
      "Ġsay": 1800,
      "Ġsend": 1801,
      "37": 1802,
      "til": 1803,
      "Ġ24": 1804,
      "Ġsol": 1805,
      "otential": 1806,
      "Cont": 1807,
      "ING": 1808,
      "Ġreturns": 1809,
      "Ġresults": 1810,
      "ires": 1811,
      "ruction": 1812,
      "Ġcomplete": 1813,
      "ert": 1814,
      "ception": 1815,
      "Ġ100": 1816,
      "Ġref": 1817,
      "agnetic": 1818,
      "Ġthose": 1819,
      "Ġcache": 1820,
      "Ġder": 1821,
      "Ġperformance": 1822,
      "Ġprevious": 1823,
      "Ġconfigur": 1824,
      "size": 1825,
      "itt": 1826,
      "98": 1827,
      "ivid": 1828,
      "Ġobtain": 1829,
      "60": 1830,
      "ches": 1831,
      "off": 1832,
      "vironment": 1833,
      "EM": 1834,
      "Ġtimes": 1835,
      "Ġseveral": 1836,
      "input": 1837,
      "Ġlock": 1838,
      "Ġequal": 1839,
      "now": 1840,
      "Ġ27": 1841,
      "perform": 1842,
      "NIX": 1843,
      "ape": 1844,
      "Ġport": 1845,
      "ET": 1846,
      "ĠWith": 1847,
      "tes": 1848,
      "Ġkind": 1849,
      "(),": 1850,
      "lay": 1851,
      "Ġcannot": 1852,
      "yper": 1853,
      "Ġoption": 1854,
      "andthe": 1855,
      "Ġkeep": 1856,
      "Ġargument": 1857,
      "has": 1858,
      "Ġcreated": 1859,
      "Ġmakes": 1860,
      "Ġut": 1861,
      "Ġbr": 1862,
      "Ġleft": 1863,
      "Ġeither": 1864,
      "Ġcorresponding": 1865,
      "Ġ</": 1866,
      "ises": 1867,
      "fl": 1868,
      "Ġsur": 1869,
      "Ġoperations": 1870,
      "br": 1871,
      "(\"": 1872,
      "action": 1873,
      "ique": 1874,
      "Ġapplications": 1875,
      "att": 1876,
      "Ġalloc": 1877,
      "ĠHere": 1878,
      "onthe": 1879,
      "ins": 1880,
      "ensity": 1881,
      "Ġ40": 1882,
      "inci": 1883,
      "Ġsit": 1884,
      "90": 1885,
      "ĠDe": 1886,
      "tring": 1887,
      "ecess": 1888,
      "AN": 1889,
      "ained": 1890,
      "Ġcomponents": 1891,
      "yle": 1892,
      "Ġturn": 1893,
      "Ġredu": 1894,
      "Ġfollows": 1895,
      "py": 1896,
      "ram": 1897,
      "irc": 1898,
      "LS": 1899,
      "izes": 1900,
      "Ġapproxim": 1901,
      "run": 1902,
      "Ġbound": 1903,
      "Ġhead": 1904,
      "Ġprovide": 1905,
      "Ġterms": 1906,
      "Ġlines": 1907,
      "eue": 1908,
      "nal": 1909,
      "tom": 1910,
      "Ġdone": 1911,
      "ention": 1912,
      "illustr": 1913,
      "Ġuseful": 1914,
      "Ġforce": 1915,
      "Ġcourse": 1916,
      "Ġpower": 1917,
      "html": 1918,
      "ĠThat": 1919,
      "Ġfields": 1920,
      "IC": 1921,
      "Ġroot": 1922,
      "ands": 1923,
      "Ġsimply": 1924,
      "Ġhapp": 1925,
      "ng": 1926,
      "Ġmodule": 1927,
      "Ġnumbers": 1928,
      "ank": 1929,
      "omain": 1930,
      "ication": 1931,
      "raw": 1932,
      "forthe": 1933,
      "Ġwords": 1934,
      "Ġmade": 1935,
      "aset": 1936,
      "book": 1937,
      "Ġvis": 1938,
      "plicit": 1939,
      "equ": 1940,
      "amed": 1941,
      "ĠNote": 1942,
      "apping": 1943,
      "atic": 1944,
      "object": 1945,
      "Ġcalls": 1946,
      "ĠExample": 1947,
      "ĠUsing": 1948,
      "current": 1949,
      "Ġlight": 1950,
      "Ġindex": 1951,
      "problem": 1952,
      "using": 1953,
      "plied": 1954,
      "Ġgradient": 1955,
      "ody": 1956,
      "Ġscal": 1957,
      "ĠBy": 1958,
      "Ġactiv": 1959,
      "Ġcertain": 1960,
      "Ġbl": 1961,
      "->": 1962,
      "Ġless": 1963,
      "gether": 1964,
      "address": 1965,
      "ayes": 1966,
      "mit": 1967,
      "Ġrespect": 1968,
      "Ġspecify": 1969,
      "ving": 1970,
      "Ġlibr": 1971,
      "Ġexper": 1972,
      "Ġworking": 1973,
      "Ġfound": 1974,
      "Ġsl": 1975,
      "mod": 1976,
      "Ġdefine": 1977,
      "\">": 1978,
      "co": 1979,
      "Ġrout": 1980,
      "Ġevent": 1981,
      "verse": 1982,
      "47": 1983,
      "45": 1984,
      "eo": 1985,
      "Ġrepl": 1986,
      "bed": 1987,
      "wise": 1988,
      "Ġhardware": 1989,
      "position": 1990,
      "Ġstatement": 1991,
      "Ġallows": 1992,
      "Ġregular": 1993,
      "ering": 1994,
      "ĠNot": 1995,
      "Ġbit": 1996,
      "Ġsearch": 1997,
      "ired": 1998,
      "65": 1999,
      "Ġalready": 2000,
      "work": 2001,
      "esign": 2002,
      "Ġlater": 2003,
      "Ġunit": 2004,
      "each": 2005,
      "li": 2006,
      "like": 2007,
      "39": 2008,
      "Ġinstead": 2009,
      "ms": 2010,
      "Ġformat": 2011,
      "Ġplace": 2012,
      "ifier": 2013,
      "values": 2014,
      "call": 2015,
      "Ġmon": 2016,
      "LL": 2017,
      "Ġloss": 2018,
      "Ġ50": 2019,
      "Ġ22": 2020,
      "Section": 2021,
      "ĠThus": 2022,
      "bject": 2023,
      "Ġcount": 2024,
      "ĠCre": 2025,
      "Ġcent": 2026,
      "ares": 2027,
      "files": 2028,
      "Ġexact": 2029,
      "ES": 2030,
      "rep": 2031,
      "Ġwait": 2032,
      "reen": 2033,
      "Ġcur": 2034,
      "ĠEach": 2035,
      "top": 2036,
      "86": 2037,
      "learning": 2038,
      "tal": 2039,
      "Ġwritten": 2040,
      "ixed": 2041,
      "RL": 2042,
      "bal": 2043,
      "Ġfrequ": 2044,
      "abase": 2045,
      "Ġcorrect": 2046,
      "ĠCont": 2047,
      "ken": 2048,
      "val": 2049,
      "Ġable": 2050,
      "ething": 2051,
      "ĠUser": 2052,
      "just": 2053,
      "edby": 2054,
      "Ġrele": 2055,
      "sequ": 2056,
      "Ġdon": 2057,
      "gular": 2058,
      "Ġbased": 2059,
      "ler": 2060,
      "cent": 2061,
      "Ġstates": 2062,
      "volution": 2063,
      "eto": 2064,
      "comp": 2065,
      "hip": 2066,
      "Ġgive": 2067,
      "ĠSup": 2068,
      "ĠHTML": 2069,
      "Ġbuil": 2070,
      "Ġintegr": 2071,
      "ds": 2072,
      "no": 2073,
      "Ġwave": 2074,
      "ging": 2075,
      "View": 2076,
      "97": 2077,
      "Ġrather": 2078,
      "Ġperm": 2079,
      "ably": 2080,
      "Ġtor": 2081,
      "Ġbegin": 2082,
      "Ġ21": 2083,
      "Ġunderstand": 2084,
      "ysis": 2085,
      "Ġusually": 2086,
      "Ġitself": 2087,
      "ĠAt": 2088,
      ".ï¿½": 2089,
      "36": 2090,
      "Ġabove": 2091,
      "omet": 2092,
      "HAPTER": 2093,
      "erial": 2094,
      "ustom": 2095,
      "Ġpredict": 2096,
      "Ġpassword": 2097,
      "Ġsignal": 2098,
      "31": 2099,
      "This": 2100,
      "Ġhidden": 2101,
      "Ġmark": 2102,
      "heduling": 2103,
      "Ġindic": 2104,
      "AM": 2105,
      "aves": 2106,
      "Ġcolumn": 2107,
      "Ġscript": 2108,
      "Ġpract": 2109,
      "Ġdescribed": 2110,
      "Ġintrodu": 2111,
      "Ġsecurity": 2112,
      "Ġphysical": 2113,
      "EE": 2114,
      "bu": 2115,
      "isf": 2116,
      "ĠProgram": 2117,
      "ĠAPI": 2118,
      "itch": 2119,
      "sin": 2120,
      "Ġ................................": 2121,
      "anc": 2122,
      "Ġmult": 2123,
      "Ġamount": 2124,
      "map": 2125,
      "Ġconfiguration": 2126,
      "Ġlabel": 2127,
      "prob": 2128,
      "Ġinterest": 2129,
      "itecture": 2130,
      "ival": 2131,
      "orage": 2132,
      "Ġvol": 2133,
      "Ġinvok": 2134,
      "bug": 2135,
      "ons": 2136,
      "Ġprograms": 2137,
      "Ġrece": 2138,
      "ĠPage": 2139,
      "Ġaround": 2140,
      "Ġlimit": 2141,
      "verage": 2142,
      "ĠBecause": 2143,
      "Ġevalu": 2144,
      "ogn": 2145,
      "CT": 2146,
      "Ġpointer": 2147,
      "Ġbehav": 2148,
      "Ġdiffere": 2149,
      "ĠProcess": 2150,
      "trans": 2151,
      "orem": 2152,
      "Ġprovides": 2153,
      ",ï¿½": 2154,
      "Ġprivate": 2155,
      "erson": 2156,
      "ides": 2157,
      "PT": 2158,
      "Ġcontent": 2159,
      "spec": 2160,
      "tun": 2161,
      "graph": 2162,
      "Ġupdate": 2163,
      "alle": 2164,
      "95": 2165,
      "new": 2166,
      "Ġbuffer": 2167,
      "Ġtakes": 2168,
      "Ġproperties": 2169,
      "eople": 2170,
      "gative": 2171,
      "Ġproblems": 2172,
      "Ġbrowser": 2173,
      "ĠPM": 2174,
      "Ġcalcul": 2175,
      "sert": 2176,
      "Ġhowever": 2177,
      "Ġinside": 2178,
      "Ġconstruct": 2179,
      "Ġbetter": 2180,
      "comple": 2181,
      "linear": 2182,
      "Ġautom": 2183,
      "Ġsqu": 2184,
      "Ġcopy": 2185,
      "Ġexpression": 2186,
      "ittle": 2187,
      "Ġnormal": 2188,
      "Ġstack": 2189,
      "sign": 2190,
      "Ġuntil": 2191,
      "imilar": 2192,
      "ture": 2193,
      "Ġdecl": 2194,
      "Ġcomputer": 2195,
      "Script": 2196,
      "write": 2197,
      "hand": 2198,
      "tocol": 2199,
      "ĠGaussian": 2200,
      "Ġmeasure": 2201,
      "Ġassociated": 2202,
      "test": 2203,
      "estion": 2204,
      "Ġtoo": 2205,
      "Ġequation": 2206,
      "Ġhttp": 2207,
      "Ġinterrupt": 2208,
      "ifies": 2209,
      "Ġelse": 2210,
      "Ġpresent": 2211,
      "Con": 2212,
      "pass": 2213,
      "Ġfour": 2214,
      "also": 2215,
      "Ġdiff": 2216,
      "Ġneeded": 2217,
      "Ġfo": 2218,
      "Ġservice": 2219,
      "Ġcommands": 2220,
      "ĠPython": 2221,
      "Ġhost": 2222,
      "Ġsets": 2223,
      "igher": 2224,
      "Ġexpress": 2225,
      "55": 2226,
      "Ġitem": 2227,
      "Ġclient": 2228,
      "Ġassum": 2229,
      "cle": 2230,
      "prov": 2231,
      "Ġ28": 2232,
      "desc": 2233,
      "feren": 2234,
      "Ġdevices": 2235,
      "ĠDis": 2236,
      "ann": 2237,
      "Ġmot": 2238,
      "Ġsequence": 2239,
      "Ġdriver": 2240,
      "Ġflag": 2241,
      "space": 2242,
      "Ġderiv": 2243,
      "code": 2244,
      "org": 2245,
      "Ġexpl": 2246,
      "();": 2247,
      "Ġidea": 2248,
      "44": 2249,
      "Ġtarget": 2250,
      "Ġpotential": 2251,
      "Ġapply": 2252,
      "aster": 2253,
      "hemat": 2254,
      "ounter": 2255,
      "met": 2256,
      "veloc": 2257,
      "Ġoriginal": 2258,
      "Ġmet": 2259,
      "Ġaction": 2260,
      "70": 2261,
      "imal": 2262,
      "Ġrequired": 2263,
      "Ġbest": 2264,
      "Ġsample": 2265,
      "icro": 2266,
      "ories": 2267,
      "Ġcolor": 2268,
      "thing": 2269,
      "po": 2270,
      "parameters": 2271,
      "isthe": 2272,
      "Ġcar": 2273,
      "Ġtogether": 2274,
      "fr": 2275,
      "self": 2276,
      "ĠSince": 2277,
      "Ġwho": 2278,
      "define": 2279,
      "Ġworks": 2280,
      "Ġsuper": 2281,
      "istics": 2282,
      "Ġwindow": 2283,
      "68": 2284,
      "case": 2285,
      "son": 2286,
      "igen": 2287,
      "det": 2288,
      "num": 2289,
      "Ġhad": 2290,
      "ĠSystem": 2291,
      "dimensional": 2292,
      "Ġlength": 2293,
      "Ġbase": 2294,
      "ĠLearning": 2295,
      "az": 2296,
      "Ġchild": 2297,
      "Ġbackground": 2298,
      "43": 2299,
      "iter": 2300,
      "ĠFirst": 2301,
      "fact": 2302,
      "Ġtell": 2303,
      "ished": 2304,
      "Ġconn": 2305,
      "sof": 2306,
      "Ġscreen": 2307,
      "Ġleast": 2308,
      "PC": 2309,
      "output": 2310,
      "Ġoperator": 2311,
      "access": 2312,
      "state": 2313,
      "oder": 2314,
      "Ġcommun": 2315,
      "Ġcharacters": 2316,
      "medi": 2317,
      "Ġden": 2318,
      "network": 2319,
      "ceed": 2320,
      "Ġimplementation": 2321,
      "distribution": 2322,
      "Ġimages": 2323,
      "IG": 2324,
      "ĠBe": 2325,
      "Ġsent": 2326,
      "Ġcases": 2327,
      "Ġvoid": 2328,
      "Ġdirection": 2329,
      "It": 2330,
      "ock": 2331,
      "Ġsem": 2332,
      "erior": 2333,
      "Ġpi": 2334,
      "Ġlaw": 2335,
      "itis": 2336,
      "Ġeasy": 2337,
      "iment": 2338,
      "Ġdirectly": 2339,
      "Ġconver": 2340,
      "ird": 2341,
      "Ġrule": 2342,
      "Ġvarious": 2343,
      "Ġstream": 2344,
      "ended": 2345,
      "Ġarguments": 2346,
      "Ġindepend": 2347,
      "])": 2348,
      "roid": 2349,
      "Ġdatabase": 2350,
      "ecessary": 2351,
      "els": 2352,
      "ores": 2353,
      "alse": 2354,
      "Ġentry": 2355,
      "57": 2356,
      "sol": 2357,
      "Ġbox": 2358,
      "ĠThey": 2359,
      "than": 2360,
      "conf": 2361,
      "Ġ--": 2362,
      "ences": 2363,
      "Ġentire": 2364,
      "Ġmarg": 2365,
      "ĠIN": 2366,
      "fromthe": 2367,
      "weight": 2368,
      "Ġtotal": 2369,
      "Ġ((": 2370,
      "Ġregression": 2371,
      "If": 2372,
      "training": 2373,
      "Ġillustr": 2374,
      "Ġmatch": 2375,
      "allel": 2376,
      "SD": 2377,
      "Ġenvironment": 2378,
      "Ar": 2379,
      "rain": 2380,
      "Chapter": 2381,
      "called": 2382,
      "Ġspecified": 2383,
      "CPU": 2384,
      "Ġcirc": 2385,
      "Ġgoing": 2386,
      "alloc": 2387,
      "Ġalong": 2388,
      "inite": 2389,
      "Ġrelative": 2390,
      "ĠInst": 2391,
      ",...,": 2392,
      "achines": 2393,
      "sib": 2394,
      "ty": 2395,
      "ister": 2396,
      "Ġarea": 2397,
      "Ġobserv": 2398,
      "tot": 2399,
      "aries": 2400,
      "Ġfinal": 2401,
      "ĠEq": 2402,
      "Ġprogramming": 2403,
      "ged": 2404,
      "Ġblocks": 2405,
      "sub": 2406,
      "Ġthink": 2407,
      "ah": 2408,
      "ouble": 2409,
      "Ġsymb": 2410,
      "istr": 2411,
      "umberof": 2412,
      "rem": 2413,
      "ĠConsider": 2414,
      "DE": 2415,
      "Ġens": 2416,
      "pen": 2417,
      "Ġthough": 2418,
      "ission": 2419,
      "velocity": 2420,
